package ru.otus.structuralpatterns;

/**
 * Neginskiy M.B. 02.03.2021
 * <p>
 * ДОМАШНЕЕ ЗАДАНИЕ
 * Обработчик сообщений
 * Цель: Применить на практике шаблоны проектирования.
 * Реализовать todo из модуля homework.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("***LETS GO***");
    }
}
